rule demo_find_account_assigned_admin_access {
  // This rule matches single events. Rules can also match multiple events within
  // some time window. For details about how to write a multi-event rule, see
  // https://cloud.google.com/chronicle/docs/detection/yara-l-2-0-overview#single-event_versus_multi-event
  
  meta:
    rule_name = "GCP account assigned admin permission"
    description = "Identifies when a user account has been granted Admin | Administrator | Owner | Editor rights"
    severity = "High"
    tactic = "T1098"
    technique = "T1098.004"

  events:
    $user.metadata.event_type = "USER_RESOURCE_UPDATE_PERMISSIONS"
    $user.metadata.product_event_type = "SetIamPolicy"
    (
        $user.principal.user.attribute.roles.name = /(roles\/.*\.admin|roles\/.*\.administrator|roles\/.*\.owner|roles\/.*\.editor)/ nocase AND
        $user.principal.user.attribute.roles.description = "ADD"
    )
  outcome:
    // For a multi-event rule an aggregation function is required
    // e.g., risk_score = max(0)
    // See https://cloud.google.com/chronicle/docs/detection/yara-l-2-0-overview#outcome_conditionals_example_rule
    $risk_score = 100

  condition:
    $user
}
